Revit 2024 API
ImageType.PageNumber Property
 The number of the page in a multi-page file, that was used to create the image in the ImageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public int PageNumber { get; }
Visual Basic
Public ReadOnly Property PageNumber As Integer
	Get
Visual C++
public:
property int PageNumber {
	int get ();
}
Remarks
 This number is set when the ImageType is created or reloaded.
See Also
ImageType Class
Autodesk.Revit.DB Namespace